[Abilities.A_BurningDetermination H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="虚空之盾"
mTooltip="每场战斗一次，他可以召唤一个护盾环绕另一个友方目标单位。虚空之盾吸收所有魔法，并且该单位获得 %buff.buff.stat1 %icon_Morale 士气和 %buff.buff.stat2 %icon_luck 幸运。持续 %buff1.buff.durini 回合。"

[Abilities.A_LightningScales H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="闪电光环"
mTooltip="单位在每回合开始时，有30%的几率获得一个电光环，在该单位回合结束时，通过 %icon_air 气系伤害所有附近单位 %buff1.buff.d1.min 到 %buff1.buff.d1.max。"

[Abilities.A_LightningScales_Buff H7BaseBuff]
mName="闪电光环"
mTooltip="在该单位回合结束时，对所有附近单位造成 %d1.min 到 %d1.max %d1.icon 气系伤害。如果没有目标被击中，光环保持激活状态。"

[Abilities.A_RangedAttack_Academy_Pyramid H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="杵击"
mTooltip="此攻击覆盖3x3区域，但只造成该生物一半的伤害。"

[Abilities.A_StormLord H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="风暴领主"
mTooltip="赋予对闪电鳞片伤害的免疫。英雄获得法术：%spell1.name。"

[Abilities.A_VoidShield_Buff H7BaseBuff]
mName="虚空之盾"
mTooltip="一个环绕该单位的护盾，吸收所有魔法（使该单位免疫），此外该单位获得 %stat1 %stat1.icon 士气和 %stat2 %stat2.icon 幸运。持续 %durnow 回合。"

[Creatures.A_CreatureStormViper H7Creature]
mName="沼泽恶魔"
mLore="秽巢实体控制了许多生活在地下的生物，以重建其军队。但有一天，在最黑暗的深处，它遇到了一个古老的恶魔，这个恶魔也躺在那里，等待着它的复仇。至今，我们不知道谁控制着谁。但这些强大的恶魔已经加入了秽巢的阵营，这对它们的对手来说是个坏消息。"